[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  // Stryker disable next-line LogicalOperator ConditionalExpression
-  if (n === 0 || n === 1) return 1;
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:20:7
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   // Stryker disable next-line LogicalOperator ConditionalExpression
-  if (n === 0 || n === 1) return 1;
+  if (n !== 0 || n === 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:20:7
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   // Stryker disable next-line LogicalOperator ConditionalExpression
-  if (n === 0 || n === 1) return 1;
+  if (true) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] BlockStatement
src/operacoes.js:89:33
   if (numeros.length === 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
-function clamp(valor, min, max) {
-  // Stryker disable next-line EqualityOperator
-  if (valor < min) return min;
-  // Stryker disable next-line EqualityOperator
-  if (valor > max) return max;
-  return valor;
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:91:7
 }
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator
-  if (valor < min) return min;
+  if (false) return min;
   // Stryker disable next-line EqualityOperator
   if (valor > max) return max;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36.2. deve ajustar valores fora do intervalo no clamp
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] ConditionalExpression
src/operacoes.js:91:7
 }
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator
-  if (valor < min) return min;
+  if (true) return min;
   // Stryker disable next-line EqualityOperator
   if (valor > max) return max;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/operacoes.js:93:7
   // Stryker disable next-line EqualityOperator
   if (valor < min) return min;
   // Stryker disable next-line EqualityOperator
-  if (valor > max) return max;
+  if (true) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ConditionalExpression
src/operacoes.js:93:7
   // Stryker disable next-line EqualityOperator
   if (valor < min) return min;
   // Stryker disable next-line EqualityOperator
-  if (valor > max) return max;
+  if (false) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36.2. deve ajustar valores fora do intervalo no clamp
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 11
